{
  "_class_name": "LTX2Vocoder",
  "_diffusers_version": "0.37.0.dev0",
  "hidden_channels": 1024,
  "in_channels": 128,
  "leaky_relu_negative_slope": 0.1,
  "out_channels": 2,
  "output_sampling_rate": 24000,
  "resnet_dilations": [
    [
      1,
      3,
      5
    ],
    [
      1,
      3,
      5
    ],
    [
      1,
      3,
      5
    ]
  ],
  "resnet_kernel_sizes": [
    3,
    7,
    11
  ],
  "upsample_factors": [
    6,
    5,
    2,
    2,
    2
  ],
  "upsample_kernel_sizes": [
    16,
    15,
    8,
    4,
    4
  ]
}
