{
  "_class_name": "LTX2TextConnectors",
  "_diffusers_version": "0.37.0.dev0",
  "audio_connector_attention_head_dim": 128,
  "audio_connector_num_attention_heads": 30,
  "audio_connector_num_layers": 2,
  "audio_connector_num_learnable_registers": 128,
  "caption_channels": 3840,
  "causal_temporal_positioning": false,
  "connector_rope_base_seq_len": 4096,
  "rope_double_precision": true,
  "rope_theta": 10000.0,
  "rope_type": "split",
  "text_proj_in_factor": 49,
  "video_connector_attention_head_dim": 128,
  "video_connector_num_attention_heads": 30,
  "video_connector_num_layers": 2,
  "video_connector_num_learnable_registers": 128
}
